#+TITLE: Emacs configuration

** Key-bindings
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "<f12>") 'org-agenda)
(global-set-key (kbd "<f9> b") 'bbdb)
(global-set-key (kbd "<f9> c") 'calendar) 
(global-set-key (kbd "<f9> w") 'forecast);; weather forecast
(global-set-key (kbd "C-c c") 'org-capture)
#+END_SRC
Key bindings for openning my org files quickly
#+BEGIN_SRC emacs-lisp
(global-set-key (kbd "\e o i")
		(lambda () (interactive) (find-file "~/Dropbox/org/inbox.org")))
(global-set-key (kbd "\e o s")
		(lambda () (interactive) (find-file "~/Dropbox/org/scholar.org")))
(global-set-key (kbd "\e o h")
		(lambda () (interactive) (find-file "~/Dropbox/org/home.org")))
(global-set-key (kbd "\e o j")
		(lambda () (interactive) (find-file "~/Dropbox/org/journal.org")))
#+END_SRC

#+RESULTS:
| lambda | nil | (interactive) | (find-file ~/Dropbox/org/home.org) |

** Setting the orgfile for data base
#+BEGIN_SRC emacs-lisp
(progn
    (elfeed-org)
    (setq rmh-elfeed-org-files (list "~/Dropbox/org/elfeed.org")))
;;(setq rmh-elfeed-org-files (list "~/Dropbox/org/elfeed.org"))
#+END_SRC

#+RESULTS:
| ~/Dropbox/org/elfeed.org |

